-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 28 2019 г., 15:34
-- Версия сервера: 5.6.41
-- Версия PHP: 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `gbphp`
--

-- --------------------------------------------------------

--
-- Структура таблицы `goods`
--

CREATE TABLE `goods` (
  `id` int(10) NOT NULL,
  `name` varchar(100) NOT NULL,
  `info` varchar(250) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `goods`
--

INSERT INTO `goods` (`id`, `name`, `info`, `price`) VALUES
(1, 'Товар 1', 'Тут информация о товаре 1', 200),
(2, 'Товар 2', 'Тут информация о товаре 2', 300),
(3, 'Товар 3', 'Описание', 230),
(4, 'Товар 4', 'Описание этого товара', 4560),
(5, 'Товар 5', 'Тут информация о товаре 5', 3500),
(6, 'Товар 6', 'Тут информация о товаре6', 420),
(7, 'Товар 7', 'Тут информация о товаре 7', 2777),
(8, 'Товар 8', 'Тут информация о товаре 8', 1200),
(9, 'Товар 9', 'Тут информация о товаре 9', 120),
(10, 'Товар 10', 'Тут информация о товаре 10', 421),
(11, 'Товар 11', 'Тут информация о товаре 11', 65),
(12, 'Товар 12', 'Тут информация о товаре 12', 1205),
(13, 'Товар 13', 'Тут информация о товаре 13', 421),
(14, 'Товар 14', 'Тут информация о товаре 14', 65),
(15, 'Товар 15', 'Тут информация о товаре 15', 1205),
(16, 'Товар 16', 'Тут информация о товаре 16', 421),
(17, 'Товар 17', 'Тут информация о товаре 17', 65),
(18, 'Товар 18', 'Тут информация о товаре 18', 1205),
(19, 'Товар 19', 'Тут информация о товаре 19', 421),
(20, 'Товар 20', 'Тут информация о товаре 20', 65),
(21, 'Товар 21', 'Тут информация о товаре 21', 1205),
(22, 'Товар 22', 'Тут информация о товаре 22', 421),
(23, 'Товар 23', 'Тут информация о товаре 23', 65),
(24, 'Товар 24', 'Тут информация о товаре 24', 1205),
(25, 'Товар 25', 'Тут информация о товаре 25', 421),
(26, 'Товар 26', 'Тут информация о товаре 26', 65),
(27, 'Товар 27', 'Тут информация о товаре 27', 1205),
(28, 'Товар 28', 'Тут информация о товаре 10', 421),
(29, 'Товар 29', 'Тут информация о товаре 11', 65),
(30, 'Товар 30', 'Тут информация о товаре 12', 1205),
(31, 'Товар 31', 'Тут информация о товаре 13', 421),
(32, 'Товар 32', 'Тут информация о товаре 14', 65),
(33, 'Товар 33', 'Тут информация о товаре 15', 1205),
(34, 'Товар 34', 'Тут информация о товаре 16', 421),
(35, 'Товар 35', 'Тут информация о товаре 17', 65),
(36, 'Товар 38', 'Тут информация о товаре 18', 1205),
(37, 'Товар 37', 'Тут информация о товаре 19', 421),
(38, 'Товар 38', 'Тут информация о товаре 20', 65),
(39, 'Товар 39', 'Тут информация о товаре 21', 1205),
(40, 'Товар 40', 'Тут информация о товаре 22', 421),
(41, 'Товар 41', 'Тут информация о товаре 23', 65),
(42, 'Товар 42', 'Тут информация о товаре 24', 1205),
(43, 'Товар 43', 'Тут информация о товаре 25', 421),
(44, 'Товар 44', 'Тут информация о товаре 26', 65),
(45, 'Товар 45', 'Тут информация о товаре 27', 1205),
(46, 'Товар 46', 'Тут информация о товаре 10', 421),
(47, 'Товар 47', 'Тут информация о товаре 11', 65),
(48, 'Товар 48', 'Тут информация о товаре 12', 1205),
(49, 'Товар 49', 'Тут информация о товаре 13', 421),
(50, 'Товар 50', 'Тут информация о товаре 14', 65),
(51, 'Товар 51', 'Тут информация о товаре 15', 1205),
(52, 'Товар 52', 'Тут информация о товаре 16', 421),
(53, 'Товар 53', 'Тут информация о товаре 17', 65),
(54, 'Товар 54', 'Тут информация о товаре 18', 1205),
(55, 'Товар 55', 'Тут информация о товаре 19', 421),
(56, 'Товар 56', 'Тут информация о товаре 20', 65),
(57, 'Товар 57', 'Тут информация о товаре 21', 1205),
(58, 'Товар 58', 'Тут информация о товаре 22', 421),
(59, 'Товар 59', 'Тут информация о товаре 23', 65),
(60, 'Товар 60', 'Тут информация о товаре 24', 1205),
(61, 'Товар 61', 'Тут информация о товаре 25', 421),
(62, 'Товар 62', 'Тут информация о товаре 26', 65),
(63, 'Товар 63', 'Тут информация о товаре 27', 1205),
(64, 'Товар 64', 'Тут информация о товаре 10', 421),
(65, 'Товар 65', 'Тут информация о товаре 11', 65),
(66, 'Товар 66', 'Тут информация о товаре 12', 1205),
(67, 'Товар 67', 'Тут информация о товаре 13', 421),
(68, 'Товар 68', 'Тут информация о товаре 14', 65),
(69, 'Товар 69', 'Тут информация о товаре 15', 1205),
(70, 'Товар 70', 'Тут информация о товаре 16', 421),
(71, 'Товар 71', 'Тут информация о товаре 17', 65),
(72, 'Товар 72', 'Тут информация о товаре 18', 1205),
(73, 'Товар 73', 'Тут информация о товаре 19', 421),
(74, 'Товар 74', 'Тут информация о товаре 20', 65),
(75, 'Товар 75', 'Тут информация о товаре 21', 1205),
(76, 'Товар 76', 'Тут информация о товаре 22', 421),
(77, 'Товар 77', 'Тут информация о товаре 23', 65),
(78, 'Товар 78', 'Тут информация о товаре 24', 1205),
(79, 'Товар 79', 'Тут информация о товаре 25', 421),
(80, 'Товар 80', 'Тут информация о товаре 26', 65),
(81, 'Товар 81', 'Тут информация о товаре 27', 1205),
(82, 'Товар 82', 'Тут информация о товаре 10', 421),
(83, 'Товар 83', 'Тут информация о товаре 11', 65),
(84, 'Товар 84', 'Тут информация о товаре 12', 1205),
(85, 'Товар 85', 'Тут информация о товаре 13', 421),
(86, 'Товар 86', 'Тут информация о товаре 14', 65),
(87, 'Товар 87', 'Тут информация о товаре 15', 1205),
(88, 'Товар 88', 'Тут информация о товаре 16', 421),
(89, 'Товар 89', 'Тут информация о товаре 17', 65),
(90, 'Товар 90', 'Тут информация о товаре 18', 1205),
(91, 'Товар 91', 'Тут информация о товаре 19', 421),
(92, 'Товар 92', 'Тут информация о товаре 20', 65),
(93, 'Товар 93', 'Тут информация о товаре 21', 1205),
(94, 'Товар 94', 'Тут информация о товаре 22', 421),
(95, 'Товар 95', 'Тут информация о товаре 23', 65),
(96, 'Товар 96', 'Тут информация о товаре 24', 1205),
(97, 'Товар 97', 'Тут информация о товаре 25', 421),
(98, 'Товар 98', 'Тут информация о товаре 26', 65),
(99, 'Товар 99', 'Тут информация о товаре 27', 1205),
(100, 'Товар 100', 'Тут информация о товаре 10', 421),
(101, 'Товар 101', 'Тут информация о товаре 11', 65),
(102, 'Товар 102', 'Тут информация о товаре 12', 1205),
(103, 'Товар 103', 'Тут информация о товаре 13', 421),
(104, 'Товар 104', 'Тут информация о товаре 14', 65),
(105, 'Товар 105', 'Тут информация о товаре 15', 1205),
(106, 'Товар 106', 'Тут информация о товаре 16', 421),
(107, 'Товар 107', 'Тут информация о товаре 17', 65),
(108, 'Товар 108', 'Тут информация о товаре 18', 1205),
(109, 'Товар 109', 'Тут информация о товаре 19', 421),
(110, 'Товар 110', 'Тут информация о товаре 20', 65),
(111, 'Товар 111', 'Тут информация о товаре 21', 1205),
(112, 'Товар 112', 'Тут информация о товаре 22', 421),
(113, 'Товар 113', 'Тут информация о товаре 23', 65),
(114, 'Товар 114', 'Тут информация о товаре 24', 1205),
(115, 'Товар 115', 'Тут информация о товаре 25', 421),
(116, 'Товар 116', 'Тут информация о товаре 26', 65),
(117, 'Товар 117', 'Тут информация о товаре 27', 1205),
(118, 'Товар 118', 'Тут информация о товаре 10', 421),
(119, 'Товар 119', 'Тут информация о товаре 11', 65),
(120, 'Товар 120', 'Тут информация о товаре 12', 1205),
(121, 'Товар 121', 'Тут информация о товаре 13', 421),
(122, 'Товар 122', 'Тут информация о товаре 14', 65),
(123, 'Товар 123', 'Тут информация о товаре 15', 1205),
(124, 'Товар 124', 'Тут информация о товаре 16', 421),
(125, 'Товар 125', 'Тут информация о товаре 17', 65),
(126, 'Товар 126', 'Тут информация о товаре 18', 1205),
(127, 'Товар 127', 'Тут информация о товаре 19', 421),
(128, 'Товар 128', 'Тут информация о товаре 20', 65),
(129, 'Товар 129', 'Тут информация о товаре 21', 1205),
(130, 'Товар 130', 'Тут информация о товаре 22', 421),
(131, 'Товар 131', 'Тут информация о товаре 23', 65),
(132, 'Товар 132', 'Тут информация о товаре 24', 1205),
(133, 'Товар 133', 'Тут информация о товаре 25', 421),
(134, 'Товар 134', 'Тут информация о товаре 26', 65),
(135, 'Товар 135', 'Тут информация о товаре 27', 1205);

-- --------------------------------------------------------

--
-- Структура таблицы `images`
--

CREATE TABLE `images` (
  `id` int(11) NOT NULL,
  `src` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `images`
--

INSERT INTO `images` (`id`, `src`) VALUES
(1, 'C:oserOSPaneldomainsgbphp/img/due18_1.jpg'),
(2, 'img');

-- --------------------------------------------------------

--
-- Структура таблицы `photos`
--

CREATE TABLE `photos` (
  `id` int(10) NOT NULL,
  `preview_src` varchar(50) NOT NULL,
  `photo_src` varchar(50) NOT NULL,
  `size` int(30) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `show_count` int(30) NOT NULL DEFAULT '0' COMMENT 'количество просмотров',
  `added` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `photos`
--

INSERT INTO `photos` (`id`, `preview_src`, `photo_src`, `size`, `name`, `show_count`, `added`) VALUES
(1, './img/min/1.jpg', './img/max/1.jpg', 661462, 'planet js', 0, '2019-01-29 12:31:00'),
(2, './img/min/2.jpg', './img/max/2.jpg', 25499, NULL, 0, '2019-01-29 12:31:00'),
(3, './img/min/3.jpg', './img/max/3.jpg', 57637, 'js class', 0, '2019-01-29 12:33:05'),
(4, './img/min/4.jpg', './img/max/4.jpg', 20832, 'объява ', 4, '2019-01-29 12:33:05');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `login` varchar(30) NOT NULL,
  `password` varchar(32) NOT NULL,
  `role` int(2) NOT NULL DEFAULT '0' COMMENT '1 - адин, 0 - юзер',
  `dob` date DEFAULT NULL,
  `delivery` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `login`, `password`, `role`, `dob`, `delivery`) VALUES
(1, 'Вася', 'admin', 'F75162EF3AADED42BC5D00C20793496F', 1, '2000-01-25', ''),
(42, 'Саня', 'sasha', 'F75162EF3AADED42BC5D00C20793496F', 0, NULL, '{\"fio\":\"Мунини Александр\",\"tel\":\"321123\",\"address\":\"Тольятти Автостроителей 10 кв 21\"}');

-- --------------------------------------------------------

--
-- Структура таблицы `zakaz`
--

CREATE TABLE `zakaz` (
  `id` int(11) NOT NULL,
  `fio` varchar(100) NOT NULL,
  `tel` varchar(20) NOT NULL,
  `address` varchar(100) NOT NULL,
  `info` text NOT NULL,
  `status` varchar(20) NOT NULL,
  `registeredas` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `zakaz`
--

INSERT INTO `zakaz` (`id`, `fio`, `tel`, `address`, `info`, `status`, `registeredas`) VALUES
(25, 'Копытин Юрий', '123456', 'Самара Коммисаров д. 12', '[{\"price\":\"300\",\"name\":\"Товар 2\",\"count\":3},{\"price\":\"4560\",\"name\":\"Товар 4\",\"count\":1}]', 'в обработке', NULL),
(27, 'Мунини Александр', '321123', 'Тольятти Автостроителей 10 кв 21', '[{\"price\":\"300\",\"name\":\"Товар 2\",\"count\":1},{\"price\":\"4560\",\"name\":\"Товар 4\",\"count\":1},{\"price\":\"230\",\"name\":\"Товар 3\",\"count\":1}]', 'в обработке', 'sasha'),
(28, 'Покутов Андрей', '987231', 'Чебоксары Латинская 20 21', '[{\"price\":\"4560\",\"name\":\"Товар 4\",\"count\":1},{\"price\":\"300\",\"name\":\"Товар 2\",\"count\":1}]', 'в обработке', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `goods`
--
ALTER TABLE `goods`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `images`
--
ALTER TABLE `images`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `photos`
--
ALTER TABLE `photos`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `zakaz`
--
ALTER TABLE `zakaz`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `goods`
--
ALTER TABLE `goods`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=136;

--
-- AUTO_INCREMENT для таблицы `images`
--
ALTER TABLE `images`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `photos`
--
ALTER TABLE `photos`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT для таблицы `zakaz`
--
ALTER TABLE `zakaz`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
